Revit 2027 API
APIObject.IsReadOnly Property
Identifies if the object is read-only or modifiable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool IsReadOnly { get; }
Public Overridable ReadOnly Property IsReadOnly As Boolean
	Get
public:
virtual property bool IsReadOnly {
	bool get ();
}
abstract IsReadOnly : bool with get
override IsReadOnly : bool with get
Property Value
Boolean
If true, the object may not be modified. If false, the object's contents may be modified.
Example
Document project = uiApplication.ActiveUIDocument.Document;
Settings settings = project.Settings;
TaskDialog.Show("Revit","Categories: " + settings.Categories.IsReadOnly.ToString());
See Also
Reference
APIObject Class
Autodesk.Revit.DB Namespace